/*****************************************************************************/
/*                Copyright 2009 - 2014, Huawei Tech. Co., Ltd.              */
/*                           ALL RIGHTS RESERVED                             */
/*                                                                           */
/* FileName: wmalloc.h                                                       */
/* Version: 01a 内存管理头文件                                               */
/*                                                                           */
/* History:                                                                  */
/* 1. 01a,2009-2-25, w54130 Create this file.                                 */
/*****************************************************************************/
#include "hi_type.h"

/******************************************************************************
*Function: wmeminit
*Description: TDE内存池初始化
*Input: 无
*Output: 无
*Return: 成功/错误码
others: 无
*******************************************************************************/
HI_S32 wmeminit(HI_VOID);

/******************************************************************************
*Function: wmalloc
*Description: 从内存池中申请内存
*Input: size 申请的内存大小
*Output: 指向内存块的指针
*Return: 无
others: 无
*******************************************************************************/
HI_VOID *wmalloc(HI_U32 size);

/******************************************************************************
*Function: wfree
*Description: 释放内存
*Input: ptr 指向内存块的指针
*Output: 无
*Return: 成功/错误码
others: 无
*******************************************************************************/
HI_S32 wfree(HI_VOID *ptr);

/******************************************************************************
*Function: wmemterm
*Description: TDE内存池去初始化
*Input: 无
*Output: 无
*Return: 无
others: 无
*******************************************************************************/
HI_VOID wmemterm(HI_VOID);

/******************************************************************************
*Function: wgetphy
*Description: 获取内存的物理地址
*Input: ptr 指向内存的指针
*Output: 物理地址
*Return: 无
others: 无
*******************************************************************************/
HI_U32 wgetphy(HI_VOID *ptr);

/******************************************************************************
*Function: wgetphy
*Description: 获取内存的虚拟地址
*Input: phyaddr 物理地址
*Output: 虚拟地址
*Return: 无
others: 无
*******************************************************************************/
HI_VOID * wgetvrt(HI_U32 phyaddr);

/******************************************************************************
*Function: wgetphy
*Description: 获取内存的剩余的Unit单元数
*Input: 无
*Output: 无
*Return: 剩余的单元数
others: 无
*******************************************************************************/
HI_U32 wgetfreenum(HI_VOID);

